const REGIONS = {
  "provinces": [
    {
      "name": "北京",
      "center": {
        "lat": 39.904989,
        "lng": 116.405285
      },
      "cities": [
        {
          "name": "北京",
          "center": {
            "lat": 39.904989,
            "lng": 116.405285
          },
          "fullName": "北京市"
        }
      ]
    },
    {
      "name": "天津",
      "center": {
        "lat": 39.125596,
        "lng": 117.190182
      },
      "cities": [
        {
          "name": "天津",
          "center": {
            "lat": 39.125596,
            "lng": 117.190182
          },
          "fullName": "天津市"
        }
      ]
    },
    {
      "name": "河北",
      "center": {
        "lat": 38.045474,
        "lng": 114.502461
      },
      "cities": [
        {
          "name": "石家庄",
          "center": {
            "lat": 38.045474,
            "lng": 114.502461
          }
        },
        {
          "name": "唐山",
          "center": {
            "lat": 39.635113,
            "lng": 118.175393
          }
        },
        {
          "name": "秦皇岛",
          "center": {
            "lat": 39.942531,
            "lng": 119.586579
          }
        },
        {
          "name": "邯郸",
          "center": {
            "lat": 36.612273,
            "lng": 114.490686
          }
        },
        {
          "name": "邢台",
          "center": {
            "lat": 37.0682,
            "lng": 114.508851
          }
        },
        {
          "name": "保定",
          "center": {
            "lat": 38.867657,
            "lng": 115.482331
          }
        },
        {
          "name": "张家口",
          "center": {
            "lat": 40.811901,
            "lng": 114.884091
          }
        },
        {
          "name": "承德",
          "center": {
            "lat": 40.976204,
            "lng": 117.939152
          }
        },
        {
          "name": "沧州",
          "center": {
            "lat": 38.310582,
            "lng": 116.857461
          }
        },
        {
          "name": "廊坊",
          "center": {
            "lat": 39.523927,
            "lng": 116.704441
          }
        },
        {
          "name": "衡水",
          "center": {
            "lat": 37.735097,
            "lng": 115.665993
          }
        }
      ]
    },
    {
      "name": "山西",
      "center": {
        "lat": 37.857014,
        "lng": 112.549248
      },
      "cities": [
        {
          "name": "太原",
          "center": {
            "lat": 37.857014,
            "lng": 112.549248
          }
        },
        {
          "name": "大同",
          "center": {
            "lat": 40.09031,
            "lng": 113.295259
          }
        },
        {
          "name": "阳泉",
          "center": {
            "lat": 37.861188,
            "lng": 113.583285
          }
        },
        {
          "name": "长治",
          "center": {
            "lat": 36.191112,
            "lng": 113.113556
          }
        },
        {
          "name": "晋城",
          "center": {
            "lat": 35.497553,
            "lng": 112.851274
          }
        },
        {
          "name": "朔州",
          "center": {
            "lat": 39.331261,
            "lng": 112.433387
          }
        },
        {
          "name": "晋中",
          "center": {
            "lat": 37.696495,
            "lng": 112.736465
          }
        },
        {
          "name": "运城",
          "center": {
            "lat": 35.022778,
            "lng": 111.003957
          }
        },
        {
          "name": "忻州",
          "center": {
            "lat": 38.41769,
            "lng": 112.733538
          }
        },
        {
          "name": "临汾",
          "center": {
            "lat": 36.08415,
            "lng": 111.517973
          }
        },
        {
          "name": "吕梁",
          "center": {
            "lat": 37.524366,
            "lng": 111.134335
          }
        }
      ]
    },
    {
      "name": "内蒙古",
      "center": {
        "lat": 40.818311,
        "lng": 111.670801
      },
      "cities": [
        {
          "name": "呼和浩特",
          "center": {
            "lat": 40.818311,
            "lng": 111.670801
          }
        },
        {
          "name": "包头",
          "center": {
            "lat": 40.658168,
            "lng": 109.840405
          }
        },
        {
          "name": "乌海",
          "center": {
            "lat": 39.673734,
            "lng": 106.825563
          }
        },
        {
          "name": "赤峰",
          "center": {
            "lat": 42.275317,
            "lng": 118.956806
          }
        },
        {
          "name": "通辽",
          "center": {
            "lat": 43.617429,
            "lng": 122.263119
          }
        },
        {
          "name": "鄂尔多斯",
          "center": {
            "lat": 39.817179,
            "lng": 109.99029
          }
        },
        {
          "name": "呼伦贝尔",
          "center": {
            "lat": 49.215333,
            "lng": 119.758168
          }
        },
        {
          "name": "巴彦淖尔",
          "center": {
            "lat": 40.757402,
            "lng": 107.416959
          }
        },
        {
          "name": "乌兰察布",
          "center": {
            "lat": 41.034126,
            "lng": 113.114543
          }
        },
        {
          "name": "兴安",
          "center": {
            "lat": 46.076268,
            "lng": 122.070317
          },
          "fullName": "兴安盟"
        },
        {
          "name": "锡林郭勒",
          "center": {
            "lat": 43.944018,
            "lng": 116.090996
          },
          "fullName": "锡林郭勒盟"
        },
        {
          "name": "阿拉善",
          "center": {
            "lat": 38.844814,
            "lng": 105.706422
          },
          "fullName": "阿拉善盟"
        }
      ]
    },
    {
      "name": "辽宁",
      "center": {
        "lat": 41.796767,
        "lng": 123.429096
      },
      "cities": [
        {
          "name": "沈阳",
          "center": {
            "lat": 41.796767,
            "lng": 123.429096
          }
        },
        {
          "name": "大连",
          "center": {
            "lat": 38.91459,
            "lng": 121.618622
          }
        },
        {
          "name": "鞍山",
          "center": {
            "lat": 41.110626,
            "lng": 122.995632
          }
        },
        {
          "name": "抚顺",
          "center": {
            "lat": 41.875956,
            "lng": 123.921109
          }
        },
        {
          "name": "本溪",
          "center": {
            "lat": 41.297909,
            "lng": 123.770519
          }
        },
        {
          "name": "丹东",
          "center": {
            "lat": 40.124296,
            "lng": 124.383044
          }
        },
        {
          "name": "锦州",
          "center": {
            "lat": 41.119269,
            "lng": 121.135742
          }
        },
        {
          "name": "营口",
          "center": {
            "lat": 40.667432,
            "lng": 122.235151
          }
        },
        {
          "name": "阜新",
          "center": {
            "lat": 42.011796,
            "lng": 121.648962
          }
        },
        {
          "name": "辽阳",
          "center": {
            "lat": 41.269402,
            "lng": 123.18152
          }
        },
        {
          "name": "盘锦",
          "center": {
            "lat": 41.124484,
            "lng": 122.06957
          }
        },
        {
          "name": "铁岭",
          "center": {
            "lat": 42.290585,
            "lng": 123.844279
          }
        },
        {
          "name": "朝阳",
          "center": {
            "lat": 41.576758,
            "lng": 120.451176
          }
        },
        {
          "name": "葫芦岛",
          "center": {
            "lat": 40.755572,
            "lng": 120.856394
          }
        }
      ]
    },
    {
      "name": "吉林",
      "center": {
        "lat": 43.886841,
        "lng": 125.3245
      },
      "cities": [
        {
          "name": "长春",
          "center": {
            "lat": 43.886841,
            "lng": 125.3245
          }
        },
        {
          "name": "吉林",
          "center": {
            "lat": 43.843577,
            "lng": 126.55302
          }
        },
        {
          "name": "四平",
          "center": {
            "lat": 43.170344,
            "lng": 124.370785
          }
        },
        {
          "name": "辽源",
          "center": {
            "lat": 42.902692,
            "lng": 125.145349
          }
        },
        {
          "name": "通化",
          "center": {
            "lat": 41.721177,
            "lng": 125.936501
          }
        },
        {
          "name": "白山",
          "center": {
            "lat": 41.942505,
            "lng": 126.427839
          }
        },
        {
          "name": "松原",
          "center": {
            "lat": 45.118243,
            "lng": 124.823608
          }
        },
        {
          "name": "白城",
          "center": {
            "lat": 45.619026,
            "lng": 122.841114
          }
        },
        {
          "name": "延边",
          "center": {
            "lat": 42.904823,
            "lng": 129.513228
          },
          "fullName": "延边朝鲜族自治州"
        }
      ]
    },
    {
      "name": "黑龙江",
      "center": {
        "lat": 45.756967,
        "lng": 126.642464
      },
      "cities": [
        {
          "name": "哈尔滨",
          "center": {
            "lat": 45.756967,
            "lng": 126.642464
          }
        },
        {
          "name": "齐齐哈尔",
          "center": {
            "lat": 47.342081,
            "lng": 123.95792
          }
        },
        {
          "name": "鸡西",
          "center": {
            "lat": 45.300046,
            "lng": 130.975966
          }
        },
        {
          "name": "鹤岗",
          "center": {
            "lat": 47.332085,
            "lng": 130.277487
          }
        },
        {
          "name": "双鸭山",
          "center": {
            "lat": 46.643442,
            "lng": 131.157304
          }
        },
        {
          "name": "大庆",
          "center": {
            "lat": 46.590734,
            "lng": 125.11272
          }
        },
        {
          "name": "伊春",
          "center": {
            "lat": 47.724775,
            "lng": 128.899396
          }
        },
        {
          "name": "佳木斯",
          "center": {
            "lat": 46.809606,
            "lng": 130.361634
          }
        },
        {
          "name": "七台河",
          "center": {
            "lat": 45.771266,
            "lng": 131.015584
          }
        },
        {
          "name": "牡丹江",
          "center": {
            "lat": 44.582962,
            "lng": 129.618602
          }
        },
        {
          "name": "黑河",
          "center": {
            "lat": 50.249585,
            "lng": 127.499023
          }
        },
        {
          "name": "绥化",
          "center": {
            "lat": 46.637393,
            "lng": 126.99293
          }
        },
        {
          "name": "大兴安岭",
          "center": {
            "lat": 52.335262,
            "lng": 124.711526
          },
          "fullName": "大兴安岭地区"
        }
      ]
    },
    {
      "name": "上海",
      "center": {
        "lat": 31.231706,
        "lng": 121.472644
      },
      "cities": [
        {
          "name": "上海",
          "center": {
            "lat": 31.231706,
            "lng": 121.472644
          },
          "fullName": "上海市"
        }
      ]
    },
    {
      "name": "江苏",
      "center": {
        "lat": 32.041544,
        "lng": 118.767413
      },
      "cities": [
        {
          "name": "南京",
          "center": {
            "lat": 32.041544,
            "lng": 118.767413
          }
        },
        {
          "name": "无锡",
          "center": {
            "lat": 31.574729,
            "lng": 120.301663
          }
        },
        {
          "name": "徐州",
          "center": {
            "lat": 34.261792,
            "lng": 117.184811
          }
        },
        {
          "name": "常州",
          "center": {
            "lat": 31.772752,
            "lng": 119.946973
          }
        },
        {
          "name": "苏州",
          "center": {
            "lat": 31.299379,
            "lng": 120.619585
          }
        },
        {
          "name": "南通",
          "center": {
            "lat": 32.016212,
            "lng": 120.864608
          }
        },
        {
          "name": "连云港",
          "center": {
            "lat": 34.600018,
            "lng": 119.178821
          }
        },
        {
          "name": "淮安",
          "center": {
            "lat": 33.597506,
            "lng": 119.021265
          }
        },
        {
          "name": "盐城",
          "center": {
            "lat": 33.377631,
            "lng": 120.139998
          }
        },
        {
          "name": "扬州",
          "center": {
            "lat": 32.393159,
            "lng": 119.421003
          }
        },
        {
          "name": "镇江",
          "center": {
            "lat": 32.204402,
            "lng": 119.452753
          }
        },
        {
          "name": "泰州",
          "center": {
            "lat": 32.484882,
            "lng": 119.915176
          }
        },
        {
          "name": "宿迁",
          "center": {
            "lat": 33.963008,
            "lng": 118.275162
          }
        }
      ]
    },
    {
      "name": "浙江",
      "center": {
        "lat": 30.287459,
        "lng": 120.153576
      },
      "cities": [
        {
          "name": "杭州",
          "center": {
            "lat": 30.287459,
            "lng": 120.153576
          }
        },
        {
          "name": "宁波",
          "center": {
            "lat": 29.868388,
            "lng": 121.549792
          }
        },
        {
          "name": "温州",
          "center": {
            "lat": 28.000575,
            "lng": 120.672111
          }
        },
        {
          "name": "嘉兴",
          "center": {
            "lat": 30.762653,
            "lng": 120.750865
          }
        },
        {
          "name": "湖州",
          "center": {
            "lat": 30.867198,
            "lng": 120.102398
          }
        },
        {
          "name": "绍兴",
          "center": {
            "lat": 29.997117,
            "lng": 120.582112
          }
        },
        {
          "name": "金华",
          "center": {
            "lat": 29.089524,
            "lng": 119.649506
          }
        },
        {
          "name": "衢州",
          "center": {
            "lat": 28.941708,
            "lng": 118.87263
          }
        },
        {
          "name": "舟山",
          "center": {
            "lat": 30.016028,
            "lng": 122.106863
          }
        },
        {
          "name": "台州",
          "center": {
            "lat": 28.661378,
            "lng": 121.428599
          }
        },
        {
          "name": "丽水",
          "center": {
            "lat": 28.451993,
            "lng": 119.921786
          }
        }
      ]
    },
    {
      "name": "安徽",
      "center": {
        "lat": 31.86119,
        "lng": 117.283042
      },
      "cities": [
        {
          "name": "合肥",
          "center": {
            "lat": 31.86119,
            "lng": 117.283042
          }
        },
        {
          "name": "芜湖",
          "center": {
            "lat": 31.326319,
            "lng": 118.376451
          }
        },
        {
          "name": "蚌埠",
          "center": {
            "lat": 32.939667,
            "lng": 117.363228
          }
        },
        {
          "name": "淮南",
          "center": {
            "lat": 32.647574,
            "lng": 117.018329
          }
        },
        {
          "name": "马鞍山",
          "center": {
            "lat": 31.689362,
            "lng": 118.507906
          }
        },
        {
          "name": "淮北",
          "center": {
            "lat": 33.971707,
            "lng": 116.794664
          }
        },
        {
          "name": "铜陵",
          "center": {
            "lat": 30.929935,
            "lng": 117.816576
          }
        },
        {
          "name": "安庆",
          "center": {
            "lat": 30.50883,
            "lng": 117.043551
          }
        },
        {
          "name": "黄山",
          "center": {
            "lat": 29.709239,
            "lng": 118.317325
          }
        },
        {
          "name": "滁州",
          "center": {
            "lat": 32.303627,
            "lng": 118.316264
          }
        },
        {
          "name": "阜阳",
          "center": {
            "lat": 32.896969,
            "lng": 115.819729
          }
        },
        {
          "name": "宿州",
          "center": {
            "lat": 33.633891,
            "lng": 116.984084
          }
        },
        {
          "name": "六安",
          "center": {
            "lat": 31.752889,
            "lng": 116.507676
          }
        },
        {
          "name": "亳州",
          "center": {
            "lat": 33.869338,
            "lng": 115.782939
          }
        },
        {
          "name": "池州",
          "center": {
            "lat": 30.656037,
            "lng": 117.489157
          }
        },
        {
          "name": "宣城",
          "center": {
            "lat": 30.945667,
            "lng": 118.757995
          }
        }
      ]
    },
    {
      "name": "福建",
      "center": {
        "lat": 26.075302,
        "lng": 119.306239
      },
      "cities": [
        {
          "name": "福州",
          "center": {
            "lat": 26.075302,
            "lng": 119.306239
          }
        },
        {
          "name": "厦门",
          "center": {
            "lat": 24.490474,
            "lng": 118.11022
          }
        },
        {
          "name": "莆田",
          "center": {
            "lat": 25.431011,
            "lng": 119.007558
          }
        },
        {
          "name": "三明",
          "center": {
            "lat": 26.265444,
            "lng": 117.635001
          }
        },
        {
          "name": "泉州",
          "center": {
            "lat": 24.908853,
            "lng": 118.589421
          }
        },
        {
          "name": "漳州",
          "center": {
            "lat": 24.510897,
            "lng": 117.661801
          }
        },
        {
          "name": "南平",
          "center": {
            "lat": 26.635627,
            "lng": 118.178459
          }
        },
        {
          "name": "龙岩",
          "center": {
            "lat": 25.091603,
            "lng": 117.02978
          }
        },
        {
          "name": "宁德",
          "center": {
            "lat": 26.65924,
            "lng": 119.527082
          }
        }
      ]
    },
    {
      "name": "江西",
      "center": {
        "lat": 28.676493,
        "lng": 115.892151
      },
      "cities": [
        {
          "name": "南昌",
          "center": {
            "lat": 28.676493,
            "lng": 115.892151
          }
        },
        {
          "name": "景德镇",
          "center": {
            "lat": 29.29256,
            "lng": 117.214664
          }
        },
        {
          "name": "萍乡",
          "center": {
            "lat": 27.622946,
            "lng": 113.852186
          }
        },
        {
          "name": "九江",
          "center": {
            "lat": 29.712034,
            "lng": 115.992811
          }
        },
        {
          "name": "新余",
          "center": {
            "lat": 27.810834,
            "lng": 114.930835
          }
        },
        {
          "name": "鹰潭",
          "center": {
            "lat": 28.238638,
            "lng": 117.033838
          }
        },
        {
          "name": "赣州",
          "center": {
            "lat": 25.85097,
            "lng": 114.940278
          }
        },
        {
          "name": "吉安",
          "center": {
            "lat": 27.111699,
            "lng": 114.986373
          }
        },
        {
          "name": "宜春",
          "center": {
            "lat": 27.8043,
            "lng": 114.391136
          }
        },
        {
          "name": "抚州",
          "center": {
            "lat": 27.98385,
            "lng": 116.358351
          }
        },
        {
          "name": "上饶",
          "center": {
            "lat": 28.44442,
            "lng": 117.971185
          }
        }
      ]
    },
    {
      "name": "山东",
      "center": {
        "lat": 36.675807,
        "lng": 117.000923
      },
      "cities": [
        {
          "name": "济南",
          "center": {
            "lat": 36.675807,
            "lng": 117.000923
          }
        },
        {
          "name": "青岛",
          "center": {
            "lat": 36.082982,
            "lng": 120.355173
          }
        },
        {
          "name": "淄博",
          "center": {
            "lat": 36.814939,
            "lng": 118.047648
          }
        },
        {
          "name": "枣庄",
          "center": {
            "lat": 34.856424,
            "lng": 117.557964
          }
        },
        {
          "name": "东营",
          "center": {
            "lat": 37.434564,
            "lng": 118.66471
          }
        },
        {
          "name": "烟台",
          "center": {
            "lat": 37.539297,
            "lng": 121.391382
          }
        },
        {
          "name": "潍坊",
          "center": {
            "lat": 36.70925,
            "lng": 119.107078
          }
        },
        {
          "name": "济宁",
          "center": {
            "lat": 35.415393,
            "lng": 116.587245
          }
        },
        {
          "name": "泰安",
          "center": {
            "lat": 36.194968,
            "lng": 117.129063
          }
        },
        {
          "name": "威海",
          "center": {
            "lat": 37.509691,
            "lng": 122.116394
          }
        },
        {
          "name": "日照",
          "center": {
            "lat": 35.428588,
            "lng": 119.461208
          }
        },
        {
          "name": "临沂",
          "center": {
            "lat": 35.065282,
            "lng": 118.326443
          }
        },
        {
          "name": "德州",
          "center": {
            "lat": 37.453968,
            "lng": 116.307428
          }
        },
        {
          "name": "聊城",
          "center": {
            "lat": 36.456013,
            "lng": 115.980367
          }
        },
        {
          "name": "滨州",
          "center": {
            "lat": 37.383542,
            "lng": 118.016974
          }
        },
        {
          "name": "菏泽",
          "center": {
            "lat": 35.246531,
            "lng": 115.469381
          }
        }
      ]
    },
    {
      "name": "河南",
      "center": {
        "lat": 34.757975,
        "lng": 113.665412
      },
      "cities": [
        {
          "name": "郑州",
          "center": {
            "lat": 34.757975,
            "lng": 113.665412
          }
        },
        {
          "name": "开封",
          "center": {
            "lat": 34.797049,
            "lng": 114.341447
          }
        },
        {
          "name": "洛阳",
          "center": {
            "lat": 34.663041,
            "lng": 112.434468
          }
        },
        {
          "name": "平顶山",
          "center": {
            "lat": 33.735241,
            "lng": 113.307718
          }
        },
        {
          "name": "安阳",
          "center": {
            "lat": 36.103442,
            "lng": 114.352482
          }
        },
        {
          "name": "鹤壁",
          "center": {
            "lat": 35.748236,
            "lng": 114.295444
          }
        },
        {
          "name": "新乡",
          "center": {
            "lat": 35.302616,
            "lng": 113.883991
          }
        },
        {
          "name": "焦作",
          "center": {
            "lat": 35.23904,
            "lng": 113.238266
          }
        },
        {
          "name": "濮阳",
          "center": {
            "lat": 35.768234,
            "lng": 115.041299
          }
        },
        {
          "name": "许昌",
          "center": {
            "lat": 34.022956,
            "lng": 113.826063
          }
        },
        {
          "name": "漯河",
          "center": {
            "lat": 33.575855,
            "lng": 114.026405
          }
        },
        {
          "name": "三门峡",
          "center": {
            "lat": 34.777338,
            "lng": 111.194099
          }
        },
        {
          "name": "南阳",
          "center": {
            "lat": 32.999082,
            "lng": 112.540918
          }
        },
        {
          "name": "商丘",
          "center": {
            "lat": 34.437054,
            "lng": 115.650497
          }
        },
        {
          "name": "信阳",
          "center": {
            "lat": 32.123274,
            "lng": 114.075031
          }
        },
        {
          "name": "周口",
          "center": {
            "lat": 33.620357,
            "lng": 114.649653
          }
        },
        {
          "name": "驻马店",
          "center": {
            "lat": 32.980169,
            "lng": 114.024736
          }
        },
        {
          "name": "济源",
          "center": {
            "lat": 35.090378,
            "lng": 112.590047
          }
        }
      ]
    },
    {
      "name": "湖北",
      "center": {
        "lat": 30.584355,
        "lng": 114.298572
      },
      "cities": [
        {
          "name": "武汉",
          "center": {
            "lat": 30.584355,
            "lng": 114.298572
          }
        },
        {
          "name": "黄石",
          "center": {
            "lat": 30.220074,
            "lng": 115.077048
          }
        },
        {
          "name": "十堰",
          "center": {
            "lat": 32.646907,
            "lng": 110.787916
          }
        },
        {
          "name": "宜昌",
          "center": {
            "lat": 30.702636,
            "lng": 111.290843
          }
        },
        {
          "name": "襄阳",
          "center": {
            "lat": 32.042426,
            "lng": 112.144146
          }
        },
        {
          "name": "鄂州",
          "center": {
            "lat": 30.396536,
            "lng": 114.890593
          }
        },
        {
          "name": "荆门",
          "center": {
            "lat": 31.03542,
            "lng": 112.204251
          }
        },
        {
          "name": "孝感",
          "center": {
            "lat": 30.926423,
            "lng": 113.926655
          }
        },
        {
          "name": "荆州",
          "center": {
            "lat": 30.326857,
            "lng": 112.23813
          }
        },
        {
          "name": "黄冈",
          "center": {
            "lat": 30.447711,
            "lng": 114.879365
          }
        },
        {
          "name": "咸宁",
          "center": {
            "lat": 29.832798,
            "lng": 114.328963
          }
        },
        {
          "name": "随州",
          "center": {
            "lat": 31.717497,
            "lng": 113.37377
          }
        },
        {
          "name": "恩施",
          "center": {
            "lat": 30.283114,
            "lng": 109.48699
          },
          "fullName": "恩施土家族苗族自治州"
        },
        {
          "name": "仙桃",
          "center": {
            "lat": 30.364953,
            "lng": 113.453974
          }
        },
        {
          "name": "潜江",
          "center": {
            "lat": 30.421215,
            "lng": 112.896866
          }
        },
        {
          "name": "天门",
          "center": {
            "lat": 30.653061,
            "lng": 113.165862
          }
        },
        {
          "name": "神农架林区",
          "center": {
            "lat": 31.744449,
            "lng": 110.671525
          }
        }
      ]
    },
    {
      "name": "湖南",
      "center": {
        "lat": 28.19409,
        "lng": 112.982279
      },
      "cities": [
        {
          "name": "长沙",
          "center": {
            "lat": 28.19409,
            "lng": 112.982279
          }
        },
        {
          "name": "株洲",
          "center": {
            "lat": 27.835806,
            "lng": 113.151737
          }
        },
        {
          "name": "湘潭",
          "center": {
            "lat": 27.82973,
            "lng": 112.944052
          }
        },
        {
          "name": "衡阳",
          "center": {
            "lat": 26.900358,
            "lng": 112.607693
          }
        },
        {
          "name": "邵阳",
          "center": {
            "lat": 27.237842,
            "lng": 111.46923
          }
        },
        {
          "name": "岳阳",
          "center": {
            "lat": 29.37029,
            "lng": 113.132855
          }
        },
        {
          "name": "常德",
          "center": {
            "lat": 29.040225,
            "lng": 111.691347
          }
        },
        {
          "name": "张家界",
          "center": {
            "lat": 29.127401,
            "lng": 110.479921
          }
        },
        {
          "name": "益阳",
          "center": {
            "lat": 28.570066,
            "lng": 112.355042
          }
        },
        {
          "name": "郴州",
          "center": {
            "lat": 25.793589,
            "lng": 113.032067
          }
        },
        {
          "name": "永州",
          "center": {
            "lat": 26.434516,
            "lng": 111.608019
          }
        },
        {
          "name": "怀化",
          "center": {
            "lat": 27.550082,
            "lng": 109.97824
          }
        },
        {
          "name": "娄底",
          "center": {
            "lat": 27.728136,
            "lng": 112.008497
          }
        },
        {
          "name": "湘西",
          "center": {
            "lat": 28.314296,
            "lng": 109.739735
          },
          "fullName": "湘西土家族苗族自治州"
        }
      ]
    },
    {
      "name": "广东",
      "center": {
        "lat": 23.125178,
        "lng": 113.280637
      },
      "cities": [
        {
          "name": "广州",
          "center": {
            "lat": 23.125178,
            "lng": 113.280637
          }
        },
        {
          "name": "韶关",
          "center": {
            "lat": 24.801322,
            "lng": 113.591544
          }
        },
        {
          "name": "深圳",
          "center": {
            "lat": 22.547,
            "lng": 114.085947
          }
        },
        {
          "name": "珠海",
          "center": {
            "lat": 22.224979,
            "lng": 113.553986
          }
        },
        {
          "name": "汕头",
          "center": {
            "lat": 23.37102,
            "lng": 116.708463
          }
        },
        {
          "name": "佛山",
          "center": {
            "lat": 23.028762,
            "lng": 113.122717
          }
        },
        {
          "name": "江门",
          "center": {
            "lat": 22.590431,
            "lng": 113.094942
          }
        },
        {
          "name": "湛江",
          "center": {
            "lat": 21.274898,
            "lng": 110.364977
          }
        },
        {
          "name": "茂名",
          "center": {
            "lat": 21.659751,
            "lng": 110.919229
          }
        },
        {
          "name": "肇庆",
          "center": {
            "lat": 23.051546,
            "lng": 112.472529
          }
        },
        {
          "name": "惠州",
          "center": {
            "lat": 23.079404,
            "lng": 114.412599
          }
        },
        {
          "name": "梅州",
          "center": {
            "lat": 24.299112,
            "lng": 116.117582
          }
        },
        {
          "name": "汕尾",
          "center": {
            "lat": 22.774485,
            "lng": 115.364238
          }
        },
        {
          "name": "河源",
          "center": {
            "lat": 23.746266,
            "lng": 114.697802
          }
        },
        {
          "name": "阳江",
          "center": {
            "lat": 21.859222,
            "lng": 111.975107
          }
        },
        {
          "name": "清远",
          "center": {
            "lat": 23.685022,
            "lng": 113.051227
          }
        },
        {
          "name": "东莞",
          "center": {
            "lat": 23.046237,
            "lng": 113.746262
          }
        },
        {
          "name": "中山",
          "center": {
            "lat": 22.521113,
            "lng": 113.382391
          }
        },
        {
          "name": "潮州",
          "center": {
            "lat": 23.661701,
            "lng": 116.632301
          }
        },
        {
          "name": "揭阳",
          "center": {
            "lat": 23.543778,
            "lng": 116.355733
          }
        },
        {
          "name": "云浮",
          "center": {
            "lat": 22.929801,
            "lng": 112.044439
          }
        }
      ]
    },
    {
      "name": "广西",
      "center": {
        "lat": 22.82402,
        "lng": 108.320004
      },
      "cities": [
        {
          "name": "南宁",
          "center": {
            "lat": 22.82402,
            "lng": 108.320004
          }
        },
        {
          "name": "柳州",
          "center": {
            "lat": 24.314617,
            "lng": 109.411703
          }
        },
        {
          "name": "桂林",
          "center": {
            "lat": 25.274215,
            "lng": 110.299121
          }
        },
        {
          "name": "梧州",
          "center": {
            "lat": 23.474803,
            "lng": 111.297604
          }
        },
        {
          "name": "北海",
          "center": {
            "lat": 21.473343,
            "lng": 109.119254
          }
        },
        {
          "name": "防城港",
          "center": {
            "lat": 21.614631,
            "lng": 108.345478
          }
        },
        {
          "name": "钦州",
          "center": {
            "lat": 21.967127,
            "lng": 108.624175
          }
        },
        {
          "name": "贵港",
          "center": {
            "lat": 23.0936,
            "lng": 109.602146
          }
        },
        {
          "name": "玉林",
          "center": {
            "lat": 22.63136,
            "lng": 110.154393
          }
        },
        {
          "name": "百色",
          "center": {
            "lat": 23.897742,
            "lng": 106.616285
          }
        },
        {
          "name": "贺州",
          "center": {
            "lat": 24.414141,
            "lng": 111.552056
          }
        },
        {
          "name": "河池",
          "center": {
            "lat": 24.695899,
            "lng": 108.062105
          }
        },
        {
          "name": "来宾",
          "center": {
            "lat": 23.733766,
            "lng": 109.229772
          }
        },
        {
          "name": "崇左",
          "center": {
            "lat": 22.404108,
            "lng": 107.353926
          }
        }
      ]
    },
    {
      "name": "海南",
      "center": {
        "lat": 20.031971,
        "lng": 110.33119
      },
      "cities": [
        {
          "name": "海口",
          "center": {
            "lat": 20.031971,
            "lng": 110.33119
          }
        },
        {
          "name": "三亚",
          "center": {
            "lat": 18.247872,
            "lng": 109.508268
          }
        },
        {
          "name": "三沙",
          "center": {
            "lat": 16.831039,
            "lng": 112.34882
          }
        },
        {
          "name": "儋州",
          "center": {
            "lat": 19.517486,
            "lng": 109.576782
          }
        },
        {
          "name": "五指山",
          "center": {
            "lat": 18.776921,
            "lng": 109.516662
          }
        },
        {
          "name": "琼海",
          "center": {
            "lat": 19.246011,
            "lng": 110.466785
          }
        },
        {
          "name": "文昌",
          "center": {
            "lat": 19.612986,
            "lng": 110.753975
          }
        },
        {
          "name": "万宁",
          "center": {
            "lat": 18.796216,
            "lng": 110.388793
          }
        },
        {
          "name": "东方",
          "center": {
            "lat": 19.10198,
            "lng": 108.653789
          }
        },
        {
          "name": "定安县",
          "center": {
            "lat": 19.684966,
            "lng": 110.349235
          }
        },
        {
          "name": "屯昌县",
          "center": {
            "lat": 19.362916,
            "lng": 110.102773
          }
        },
        {
          "name": "澄迈县",
          "center": {
            "lat": 19.737095,
            "lng": 110.007147
          }
        },
        {
          "name": "临高县",
          "center": {
            "lat": 19.908293,
            "lng": 109.687697
          }
        },
        {
          "name": "白沙黎族自治县",
          "center": {
            "lat": 19.224584,
            "lng": 109.452606
          }
        },
        {
          "name": "昌江黎族自治县",
          "center": {
            "lat": 19.260968,
            "lng": 109.053351
          }
        },
        {
          "name": "乐东黎族自治县",
          "center": {
            "lat": 18.74758,
            "lng": 109.175444
          }
        },
        {
          "name": "陵水黎族自治县",
          "center": {
            "lat": 18.505006,
            "lng": 110.037218
          }
        },
        {
          "name": "保亭黎族苗族自治县",
          "center": {
            "lat": 18.636371,
            "lng": 109.70245
          }
        },
        {
          "name": "琼中黎族苗族自治县",
          "center": {
            "lat": 19.03557,
            "lng": 109.839996
          }
        }
      ]
    },
    {
      "name": "重庆",
      "center": {
        "lat": 29.533155,
        "lng": 106.504962
      },
      "cities": [
        {
          "name": "重庆",
          "center": {
            "lat": 29.533155,
            "lng": 106.504962
          },
          "fullName": "重庆市"
        }
      ]
    },
    {
      "name": "四川",
      "center": {
        "lat": 30.659462,
        "lng": 104.065735
      },
      "cities": [
        {
          "name": "成都",
          "center": {
            "lat": 30.659462,
            "lng": 104.065735
          }
        },
        {
          "name": "自贡",
          "center": {
            "lat": 29.352765,
            "lng": 104.773447
          }
        },
        {
          "name": "攀枝花",
          "center": {
            "lat": 26.580446,
            "lng": 101.716007
          }
        },
        {
          "name": "泸州",
          "center": {
            "lat": 28.889138,
            "lng": 105.443348
          }
        },
        {
          "name": "德阳",
          "center": {
            "lat": 31.127991,
            "lng": 104.398651
          }
        },
        {
          "name": "绵阳",
          "center": {
            "lat": 31.46402,
            "lng": 104.741722
          }
        },
        {
          "name": "广元",
          "center": {
            "lat": 32.433668,
            "lng": 105.829757
          }
        },
        {
          "name": "遂宁",
          "center": {
            "lat": 30.513311,
            "lng": 105.571331
          }
        },
        {
          "name": "内江",
          "center": {
            "lat": 29.58708,
            "lng": 105.066138
          }
        },
        {
          "name": "乐山",
          "center": {
            "lat": 29.582024,
            "lng": 103.761263
          }
        },
        {
          "name": "南充",
          "center": {
            "lat": 30.795281,
            "lng": 106.082974
          }
        },
        {
          "name": "眉山",
          "center": {
            "lat": 30.048318,
            "lng": 103.831788
          }
        },
        {
          "name": "宜宾",
          "center": {
            "lat": 28.760189,
            "lng": 104.630825
          }
        },
        {
          "name": "广安",
          "center": {
            "lat": 30.456398,
            "lng": 106.633369
          }
        },
        {
          "name": "达州",
          "center": {
            "lat": 31.209484,
            "lng": 107.502262
          }
        },
        {
          "name": "雅安",
          "center": {
            "lat": 29.987722,
            "lng": 103.001033
          }
        },
        {
          "name": "巴中",
          "center": {
            "lat": 31.858809,
            "lng": 106.753669
          }
        },
        {
          "name": "资阳",
          "center": {
            "lat": 30.122211,
            "lng": 104.641917
          }
        },
        {
          "name": "阿坝",
          "center": {
            "lat": 31.899792,
            "lng": 102.221374
          },
          "fullName": "阿坝藏族羌族自治州"
        },
        {
          "name": "甘孜",
          "center": {
            "lat": 30.050663,
            "lng": 101.963815
          },
          "fullName": "甘孜藏族自治州"
        },
        {
          "name": "凉山",
          "center": {
            "lat": 27.886762,
            "lng": 102.258746
          },
          "fullName": "凉山彝族自治州"
        }
      ]
    },
    {
      "name": "贵州",
      "center": {
        "lat": 26.578343,
        "lng": 106.713478
      },
      "cities": [
        {
          "name": "贵阳",
          "center": {
            "lat": 26.578343,
            "lng": 106.713478
          }
        },
        {
          "name": "六盘水",
          "center": {
            "lat": 26.584643,
            "lng": 104.846743
          }
        },
        {
          "name": "遵义",
          "center": {
            "lat": 27.706626,
            "lng": 106.937265
          }
        },
        {
          "name": "安顺",
          "center": {
            "lat": 26.245544,
            "lng": 105.932188
          }
        },
        {
          "name": "毕节",
          "center": {
            "lat": 27.301693,
            "lng": 105.28501
          }
        },
        {
          "name": "铜仁",
          "center": {
            "lat": 27.718346,
            "lng": 109.191555
          }
        },
        {
          "name": "黔西南",
          "center": {
            "lat": 25.08812,
            "lng": 104.897971
          },
          "fullName": "黔西南布依族苗族自治州"
        },
        {
          "name": "黔东南",
          "center": {
            "lat": 26.583352,
            "lng": 107.977488
          },
          "fullName": "黔东南苗族侗族自治州"
        },
        {
          "name": "黔南",
          "center": {
            "lat": 26.258219,
            "lng": 107.517156
          },
          "fullName": "黔南布依族苗族自治州"
        }
      ]
    },
    {
      "name": "云南",
      "center": {
        "lat": 25.040609,
        "lng": 102.712251
      },
      "cities": [
        {
          "name": "昆明",
          "center": {
            "lat": 25.040609,
            "lng": 102.712251
          }
        },
        {
          "name": "曲靖",
          "center": {
            "lat": 25.501557,
            "lng": 103.797851
          }
        },
        {
          "name": "玉溪",
          "center": {
            "lat": 24.350461,
            "lng": 102.543907
          }
        },
        {
          "name": "保山",
          "center": {
            "lat": 25.111802,
            "lng": 99.167133
          }
        },
        {
          "name": "昭通",
          "center": {
            "lat": 27.336999,
            "lng": 103.717216
          }
        },
        {
          "name": "丽江",
          "center": {
            "lat": 26.872108,
            "lng": 100.233026
          }
        },
        {
          "name": "普洱",
          "center": {
            "lat": 22.777321,
            "lng": 100.972344
          }
        },
        {
          "name": "临沧",
          "center": {
            "lat": 23.886567,
            "lng": 100.08697
          }
        },
        {
          "name": "楚雄",
          "center": {
            "lat": 25.041988,
            "lng": 101.546046
          },
          "fullName": "楚雄彝族自治州"
        },
        {
          "name": "红河",
          "center": {
            "lat": 23.366775,
            "lng": 103.384182
          },
          "fullName": "红河哈尼族彝族自治州"
        },
        {
          "name": "文山壮族",
          "center": {
            "lat": 23.36951,
            "lng": 104.24401
          },
          "fullName": "文山壮族苗族自治州"
        },
        {
          "name": "西双版纳",
          "center": {
            "lat": 22.001724,
            "lng": 100.797941
          },
          "fullName": "西双版纳傣族自治州"
        },
        {
          "name": "大理",
          "center": {
            "lat": 25.589449,
            "lng": 100.225668
          },
          "fullName": "大理白族自治州"
        },
        {
          "name": "德宏",
          "center": {
            "lat": 24.436694,
            "lng": 98.578363
          },
          "fullName": "德宏傣族景颇族自治州"
        },
        {
          "name": "怒江",
          "center": {
            "lat": 25.850949,
            "lng": 98.854304
          },
          "fullName": "怒江傈僳族自治州"
        },
        {
          "name": "迪庆",
          "center": {
            "lat": 27.826853,
            "lng": 99.706463
          },
          "fullName": "迪庆藏族自治州"
        }
      ]
    },
    {
      "name": "西藏",
      "center": {
        "lat": 29.660361,
        "lng": 91.132212
      },
      "cities": [
        {
          "name": "拉萨",
          "center": {
            "lat": 29.660361,
            "lng": 91.132212
          }
        },
        {
          "name": "日喀则",
          "center": {
            "lat": 29.267519,
            "lng": 88.885148
          }
        },
        {
          "name": "昌都",
          "center": {
            "lat": 31.136875,
            "lng": 97.178452
          }
        },
        {
          "name": "林芝",
          "center": {
            "lat": 29.654693,
            "lng": 94.362348
          }
        },
        {
          "name": "山南",
          "center": {
            "lat": 29.236023,
            "lng": 91.766529
          }
        },
        {
          "name": "那曲",
          "center": {
            "lat": 31.476004,
            "lng": 92.060214
          }
        },
        {
          "name": "阿里",
          "center": {
            "lat": 32.503187,
            "lng": 80.105498
          },
          "fullName": "阿里地区"
        }
      ]
    },
    {
      "name": "陕西",
      "center": {
        "lat": 34.263161,
        "lng": 108.948024
      },
      "cities": [
        {
          "name": "西安",
          "center": {
            "lat": 34.263161,
            "lng": 108.948024
          }
        },
        {
          "name": "铜川",
          "center": {
            "lat": 34.916582,
            "lng": 108.979608
          }
        },
        {
          "name": "宝鸡",
          "center": {
            "lat": 34.369315,
            "lng": 107.14487
          }
        },
        {
          "name": "咸阳",
          "center": {
            "lat": 34.333439,
            "lng": 108.705117
          }
        },
        {
          "name": "渭南",
          "center": {
            "lat": 34.499381,
            "lng": 109.502882
          }
        },
        {
          "name": "延安",
          "center": {
            "lat": 36.596537,
            "lng": 109.49081
          }
        },
        {
          "name": "汉中",
          "center": {
            "lat": 33.077668,
            "lng": 107.028621
          }
        },
        {
          "name": "榆林",
          "center": {
            "lat": 38.290162,
            "lng": 109.741193
          }
        },
        {
          "name": "安康",
          "center": {
            "lat": 32.6903,
            "lng": 109.029273
          }
        },
        {
          "name": "商洛",
          "center": {
            "lat": 33.868319,
            "lng": 109.939776
          }
        }
      ]
    },
    {
      "name": "甘肃",
      "center": {
        "lat": 36.058039,
        "lng": 103.823557
      },
      "cities": [
        {
          "name": "兰州",
          "center": {
            "lat": 36.058039,
            "lng": 103.823557
          }
        },
        {
          "name": "嘉峪关",
          "center": {
            "lat": 39.786529,
            "lng": 98.277304
          }
        },
        {
          "name": "金昌",
          "center": {
            "lat": 38.514238,
            "lng": 102.187888
          }
        },
        {
          "name": "白银",
          "center": {
            "lat": 36.54568,
            "lng": 104.173606
          }
        },
        {
          "name": "天水",
          "center": {
            "lat": 34.578529,
            "lng": 105.724998
          }
        },
        {
          "name": "武威",
          "center": {
            "lat": 37.929996,
            "lng": 102.634697
          }
        },
        {
          "name": "张掖",
          "center": {
            "lat": 38.932897,
            "lng": 100.455472
          }
        },
        {
          "name": "平凉",
          "center": {
            "lat": 35.54279,
            "lng": 106.684691
          }
        },
        {
          "name": "酒泉",
          "center": {
            "lat": 39.744023,
            "lng": 98.510795
          }
        },
        {
          "name": "庆阳",
          "center": {
            "lat": 35.734218,
            "lng": 107.638372
          }
        },
        {
          "name": "定西",
          "center": {
            "lat": 35.579578,
            "lng": 104.626294
          }
        },
        {
          "name": "陇南",
          "center": {
            "lat": 33.388598,
            "lng": 104.929379
          }
        },
        {
          "name": "临夏",
          "center": {
            "lat": 35.599446,
            "lng": 103.212006
          },
          "fullName": "临夏回族自治州"
        },
        {
          "name": "甘南",
          "center": {
            "lat": 34.986354,
            "lng": 102.911008
          },
          "fullName": "甘南藏族自治州"
        }
      ]
    },
    {
      "name": "青海",
      "center": {
        "lat": 36.623178,
        "lng": 101.778916
      },
      "cities": [
        {
          "name": "西宁",
          "center": {
            "lat": 36.623178,
            "lng": 101.778916
          }
        },
        {
          "name": "海东",
          "center": {
            "lat": 36.502916,
            "lng": 102.10327
          }
        },
        {
          "name": "海北",
          "center": {
            "lat": 36.959435,
            "lng": 100.901059
          },
          "fullName": "海北藏族自治州"
        },
        {
          "name": "黄南",
          "center": {
            "lat": 35.517744,
            "lng": 102.019988
          },
          "fullName": "黄南藏族自治州"
        },
        {
          "name": "海南",
          "center": {
            "lat": 36.280353,
            "lng": 100.619542
          },
          "fullName": "海南藏族自治州"
        },
        {
          "name": "果洛",
          "center": {
            "lat": 34.4736,
            "lng": 100.242143
          },
          "fullName": "果洛藏族自治州"
        },
        {
          "name": "玉树",
          "center": {
            "lat": 33.004049,
            "lng": 97.008522
          },
          "fullName": "玉树藏族自治州"
        },
        {
          "name": "海西",
          "center": {
            "lat": 37.374663,
            "lng": 97.370785
          },
          "fullName": "海西蒙古族藏族自治州"
        }
      ]
    },
    {
      "name": "宁夏",
      "center": {
        "lat": 38.46637,
        "lng": 106.278179
      },
      "cities": [
        {
          "name": "银川",
          "center": {
            "lat": 38.46637,
            "lng": 106.278179
          }
        },
        {
          "name": "石嘴山",
          "center": {
            "lat": 39.01333,
            "lng": 106.376173
          }
        },
        {
          "name": "吴忠",
          "center": {
            "lat": 37.986165,
            "lng": 106.199409
          }
        },
        {
          "name": "固原",
          "center": {
            "lat": 36.004561,
            "lng": 106.285241
          }
        },
        {
          "name": "中卫",
          "center": {
            "lat": 37.514951,
            "lng": 105.189568
          }
        }
      ]
    },
    {
      "name": "新疆",
      "center": {
        "lat": 43.792818,
        "lng": 87.617733
      },
      "cities": [
        {
          "name": "乌鲁木齐",
          "center": {
            "lat": 43.792818,
            "lng": 87.617733
          }
        },
        {
          "name": "克拉玛依",
          "center": {
            "lat": 45.595886,
            "lng": 84.873946
          }
        },
        {
          "name": "吐鲁番",
          "center": {
            "lat": 42.947613,
            "lng": 89.184078
          }
        },
        {
          "name": "哈密",
          "center": {
            "lat": 42.833248,
            "lng": 93.51316
          }
        },
        {
          "name": "昌吉",
          "center": {
            "lat": 44.014577,
            "lng": 87.304012
          },
          "fullName": "昌吉回族自治州"
        },
        {
          "name": "博尔塔拉",
          "center": {
            "lat": 44.903258,
            "lng": 82.074778
          },
          "fullName": "博尔塔拉蒙古自治州"
        },
        {
          "name": "巴音郭楞",
          "center": {
            "lat": 41.768552,
            "lng": 86.150969
          },
          "fullName": "巴音郭楞蒙古自治州"
        },
        {
          "name": "阿克苏",
          "center": {
            "lat": 41.170712,
            "lng": 80.265068
          },
          "fullName": "阿克苏地区"
        },
        {
          "name": "克孜勒苏",
          "center": {
            "lat": 39.713431,
            "lng": 76.172825
          },
          "fullName": "克孜勒苏柯尔克孜自治州"
        },
        {
          "name": "喀什",
          "center": {
            "lat": 39.467664,
            "lng": 75.989138
          },
          "fullName": "喀什地区"
        },
        {
          "name": "和田",
          "center": {
            "lat": 37.110687,
            "lng": 79.92533
          },
          "fullName": "和田地区"
        },
        {
          "name": "伊犁",
          "center": {
            "lat": 43.92186,
            "lng": 81.317946
          },
          "fullName": "伊犁哈萨克自治州"
        },
        {
          "name": "塔城",
          "center": {
            "lat": 46.746301,
            "lng": 82.985732
          },
          "fullName": "塔城地区"
        },
        {
          "name": "阿勒泰",
          "center": {
            "lat": 47.848393,
            "lng": 88.13963
          },
          "fullName": "阿勒泰地区"
        },
        {
          "name": "石河子",
          "center": {
            "lat": 44.305886,
            "lng": 86.041075
          }
        },
        {
          "name": "阿拉尔",
          "center": {
            "lat": 40.541914,
            "lng": 81.285884
          }
        },
        {
          "name": "图木舒克",
          "center": {
            "lat": 39.867316,
            "lng": 79.077978
          }
        },
        {
          "name": "五家渠",
          "center": {
            "lat": 44.167401,
            "lng": 87.526884
          }
        },
        {
          "name": "北屯",
          "center": {
            "lat": 47.353177,
            "lng": 87.824932
          }
        },
        {
          "name": "铁门关",
          "center": {
            "lat": 41.827251,
            "lng": 85.501218
          }
        },
        {
          "name": "双河",
          "center": {
            "lat": 44.840524,
            "lng": 82.353656
          }
        },
        {
          "name": "可克达拉",
          "center": {
            "lat": 43.6832,
            "lng": 80.63579
          }
        },
        {
          "name": "昆玉",
          "center": {
            "lat": 37.207994,
            "lng": 79.287372
          }
        },
        {
          "name": "胡杨河",
          "center": {
            "lat": 44.692889,
            "lng": 84.827596
          }
        }
      ]
    },
    {
      "name": "台湾",
      "center": {
        "lat": 25.044332,
        "lng": 121.509062
      },
      "cities": [
        {
          "name": "台湾",
          "center": {
            "lat": 25.044332,
            "lng": 121.509062
          },
          "fullName": "台湾省"
        }
      ]
    },
    {
      "name": "香港",
      "center": {
        "lat": 22.320048,
        "lng": 114.173355
      },
      "cities": [
        {
          "name": "香港",
          "center": {
            "lat": 22.320048,
            "lng": 114.173355
          },
          "fullName": "香港特别行政区"
        }
      ]
    },
    {
      "name": "澳门",
      "center": {
        "lat": 22.198951,
        "lng": 113.54909
      },
      "cities": [
        {
          "name": "澳门",
          "center": {
            "lat": 22.198951,
            "lng": 113.54909
          },
          "fullName": "澳门特别行政区"
        }
      ]
    }
  ]
};
module.exports = REGIONS;
